# SlabShapeCreases Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..SlabShapeCreases Property
SlabShapeEditor Class See Also
---
All of the creases that can be edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeCreaseArray SlabShapeCreases { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SlabShapeCreases As SlabShapeCreaseArray
	Get
```

Visual C++
---
```text
public:
property SlabShapeCreaseArray^ SlabShapeCreases {
	SlabShapeCreaseArray^ get ();
}
```

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace